---
type: MEPAnalyticalSegment
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 12
tags: [revit-api, class]
---

# MEPAnalyticalSegment

`Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Area | 2024 | `public double Area { get ; }` |
| Property | DemandFlow | 2024 | `public double DemandFlow { get ; }` |
| Property | DomainType | 2024 | `public ConnectorDomainType DomainType { get ; }` |
| Property | EndNode | 2024 | `public int EndNode { get ; }` |
| Property | Id | 2024 | `public int Id { get ; }` |
| Property | InnerDiameter | 2024 | `public double InnerDiameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | RevitElementId | 2024 | `public ElementId RevitElementId { get ; }` |
| Property | Roughness | 2024 | `public double Roughness { get ; }` |
| Property | SegmentType | 2024 | `public MEPAnalyticalSegmentType SegmentType { get ; }` |
| Property | StartNode | 2024 | `public int StartNode { get ; }` |